package com.allst.boot.word;

import java.util.List;

/**
 * @author Hutu
 * @since 2024-07-27 下午 06:14
 */
public class InfoConstants {
    public static final List<String> nameList = List.of("副本标题", " 主题内核", "场景名称", " 场景描述", "关键元素", "游戏规则", " 剧情发展", "NPC角色", " 死亡方式", "通关条件", "背景故事", "真相");
    public static final List<String> descList = List.of("《星陨之城》", "生存", "星陨之城", "一个位于遥远星系边缘的废弃太空站，传说中是星际旅行者的最后归宿。", "星核，一种能够操控星辰轨迹的神秘力量源泉。",
            "玩家必须在星陨之城中寻找星核碎片，解开其力量，同时抵御来自异星生物的侵袭。", "玩家在探索星陨之城的过程中，逐渐揭开太空站废弃的真相和星核的秘密。", "太空站的前工作人员，他们或许知道星核的秘密，但也可能因长时间的孤独而变得疯狂。",
            "异星生物的攻击、太空站的陷阱、解谜失败导致的爆炸。",
            "成功解开星核的力量，揭开太空站的秘密，并安全逃离星陨之城。","星陨之城曾是星际旅行者的圣地，一个充满希望和梦想的太空站。然而，随着一次灾难性的事件，太空站与外界失去了联系，成为了一个被遗忘的角落。传说，在太空站的核心，隐藏着一种名为星核的神秘力量，它能够操控星辰的轨迹，甚至改变命运。但星核的力量也是一把双刃剑，它不仅带来了希望，也带来了毁灭。玩家们被选中进入星陨之城，他们必须在这座废弃的太空站中寻找星核的碎片，解开其力量的秘密。但太空站并不是空无一人，异星生物在暗处潜伏，前工作人员的幽灵在走廊中游荡。玩家们必须在这场生死游戏中找到生存的希望，或是成为星陨之城的又一个传说。",
            "星核的力量并非自然形成，而是太空站的科学家们在进行一项禁忌实验时意外创造的。这项实验试图通过操控星辰的轨迹来改变人类的命运，但最终失控，导致了太空站的毁灭。");
}
